src/Documents/УстановкаУчетнойПолитикиОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>УстановкаУчетнойПолитикиОрганизации</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>InformationRegister.УчетнаяПолитика</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УчетнаяПолитика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетнойПолитики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитика</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчетнаяПолитика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетнойПолитики</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоТоваров</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ВидыУчетнойПолитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ВидыУчетнойПолитики</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FEFO</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/УстановкаУчетнойПолитикиОрганизации/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(_, __)
	Движения.УчетнаяПолитика.Записывать = Истина;
	выполнитьДвижениеПоУчетнаяПолитика();

	Если УчетнаяПолитика = Перечисления.ВидыУчетнойПолитики.ПоСредней Тогда
		Движения.ТоварыНаСкладах.Записывать = Истина;
		выполнитьВсеДвиженияПоСкладам();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

#Область Движения
Процедура выполнитьДвижениеПоУчетнаяПолитика()
	движение = Движения.УчетнаяПолитика.Добавить();
	движение.Период = Дата;
	движение.УчетнаяПолитика = УчетнаяПолитика;
КонецПроцедуры

Функция создатьДвижениеПоСкладам(Знач период, Знач видДвижения = Неопределено)
	видДвижения = ?(видДвижения = Неопределено, ВидДвиженияНакопления.Приход, видДвижения);
	движение = Движения.ТоварыНаСкладах.Добавить();
	движение.ВидДвижения = видДвижения;
	движение.Период = период;
	
	Возврат движение;
КонецФункции

Процедура выполнитьДвижениеПоСкладам(строкаОстатки)
	движение = создатьДвижениеПоСкладам(Дата, ВидДвиженияНакопления.Расход);
	ЗаполнитьЗначенияСвойств(движение, строкаОстатки);

	движение = создатьДвижениеПоСкладам(Дата, ВидДвиженияНакопления.Приход);
	ЗаполнитьЗначенияСвойств(движение, строкаОстатки, , "СрокГодности");
КонецПроцедуры

Процедура выполнитьВсеДвиженияПоСкладам()
	блокировка = создатьБлокировкуТоваровНаСкладах();
	блокировка.Заблокировать();

	выборкаОстатки = получитьВыборкуОстаткиНаСкладах();
	Пока выборкаОстатки.Следующий() Цикл
		выполнитьДвижениеПоСкладам(выборкаОстатки);
	КонецЦикла;
КонецПроцедуры
#КонецОбласти // Движения

Функция получитьВыборкуОстаткиНаСкладах()
	запросОстатков = Новый Запрос;
	запросОстатков.УстановитьПараметр("МоментИтогов", Новый Граница(МоментВремени()));

	запросОстатков.Текст =
		"ВЫБРАТЬ
		|    ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|    ТоварыНаСкладахОстатки.Склад КАК Склад,
		|    ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности,
		|    ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество,
		|    ТоварыНаСкладахОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|    РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментИтогов) КАК ТоварыНаСкладахОстатки";

	Возврат запросОстатков.Выполнить().Выбрать();
КонецФункции

Функция создатьБлокировкуТоваровНаСкладах()
	блокировка = Новый БлокировкаДанных;
	элементБлокировки = блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
	элементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Возврат блокировка;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
